.doom.d/config.el
;;; ~/.doom.d/config.el -*- lexical-binding: t; -*-

(setq user-full-name "Chaitanya Afle"
      user-mail-address "aflechaitanya@gmail.com")

(setq
 undo-limit 20000000                    ; Raise undo limit to 20Mb
 )

(display-time-mode 1)                   ; Enable time display in mode-line
(setq display-time-day-and-date t)
(display-time)

(setq display-line-numbers-type t)      ; Enable Relative line numbering display

(defun doom-modeline-conditional-buffer-encoding () ; Remove the encoding display in mode-line unless its not UTF-8
  (setq-local doom-modeline-buffer-encoding
              (unless (or (eq buffer-file-coding-system 'utf-8-unix)
                          (eq buffer-file-coding-system 'utf-8)))))
(add-hook 'after-change-major-mode-hook
          'doom-modeline-conditional-buffer-encoding)

(setq debug-on-error t)

(if (eq initial-window-system 'x)                 ; if started by emacs command or desktop file
    (toggle-frame-maximized)
  (toggle-frame-fullscreen))
;; (add-hook 'window-configuration-change-hook
;;           (lambda ()
;;             (set-window-margins (car (get-buffer-window-list (current-buffer) nil t)) 8 8)))

(dolist (hook '(org-mode-hook))
  (add-hook hook (lambda () (flyspell-mode 1))))

(eval-after-load "flyspell"
  '(progn
     (define-key flyspell-mouse-map [down-mouse-3] #'flyspell-correct-word)
     (define-key flyspell-mouse-map [mouse-3] #'undefined)))

(setq doom-theme 'doom-one)             ; Set the theme

(setq doom-font (font-spec :family "Iosevka Term SS04" :size 18)
      doom-variable-pitch-font (font-spec :family "Fira Mono")
      doom-big-font (font-spec :family "DejaVu Sans Mono" :size 24))
(after! doom-themes
  (setq doom-themes-enable-bold t
        doom-themes-enable-italic t))
;; (custom-set-faces!
;;   '(font-lock-comment-face :slant italic)
;;   '(font-lock-keyword-face :slant italic))

(add-hook! '(+doom-dashboard-mode-hook)
         (setq fancy-splash-image "~/.doom.d/images/black_hole.png"))
        ;; (setq fancy-splash-image "~/.doom.d/images/Time.png"))

(after! doom-modeline
  (doom-modeline-def-modeline 'main
    '(bar matches buffer-info remote-host buffer-position parrot selection-info)
    '(misc-info minor-modes checker input-method buffer-encoding major-mode process vcs "  ")))

(setq org-directory "~/org/"
      org-roam-directory "~/org/"
      org-ellipsis " ▼ ")

(defun ca/org-mode-visual-fill ()
  (setq visual-fill-column-width 180
        visual-fill-column-center-text t)
  (visual-fill-column-mode 1))

(use-package visual-fill-column
  :hook (org-mode . ca/org-mode-visual-fill))

(after! org-superstar
  (setq org-superstar-headline-bullets-list '("◉" "○" "✸" "✿" "✤" "✜" "◆" "▶")
        org-superstar-prettify-item-bullets t ))

(use-package org-roam
  :init
  (setq org-roam-v2-ack t)
  :custom
  (org-roam-completion-everywhere t)
  (org-roam-dailies-directory "daily/")
  (org-roam-dailies-capture-templates
   '(("j" "Journal" entry
      "* %<%I:%M %p>: %?"
      :if-new (file+head+olp "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n#+filetags: Dailies\n\n" ("Journal"))
      :unnarrowed t)
     ("i" "Idea" entry
      "* %<%I:%M %p>: %?"
      :if-new (file+head+olp "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n#+filetags: Dailies\n\n" ("Ideas"))
      :unnarrowed t)
     ("t" "Task" entry
      "** TODO %?"
      :if-new (file+head+olp "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n#+filetags: Dailies\n\n" ("Tasks"))
      :unnarrowed t)
     ("r" "Reading" entry
      "** TODO %?"
      :if-new (file+head+olp "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n#+filetags: Dailies\n\n" ("Reading"))
      :unnarrowed t)))
  (org-roam-capture-templates
        '(("d" "default" plain "%?"
           :if-new (file+head "misc/%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+author: %(concat user-full-name)\n#+email: %(concat user-mail-address)\n#+created: %(format-time-string \"[%Y-%m-%d %H:%M]\")\n#+filetags:%^g\n\n")
           :unnarrowed t)
          ("r" "Research" plain "%?"
           :if-new (file+head "research/${slug}.org" "#+title: ${title}\n#+author: %(concat user-full-name)\n#+email: %(concat user-mail-address)\n#+created: %(format-time-string \"[%Y-%m-%d %H:%M]\")\n#+filetags:%^g\n\n")
           :unnarrowed t)
          ("a" "Research note with an attachment" entry "*** %?"
          :if-new
          (file+head"research/${slug}.org"
                    "#+title: ${title}\n#+author: %(concat user-full-name)\n#+email: %(concat user-mail-address)\n#+filetags: notes\n* ${title}\n  :PROPERTIES:\n  :NOTER_DOCUMENT: [[~/org/research/pdfs/%^{pdf_filename}]]\n  :END:\n\n")
          :unnarrowed t)))

          ;; ("a" "Research note with an attachment" plain "%?"
          ;; :if-new (file+head "research/${slug}.org" "#+title: ${title}\n#+author: %(concat      user-full-name)\n#+email: %(concat user-mail-address)\n#+file: [[~/org/research/pdfs/%^]]\n#+created: %(format-time-string \"[%Y-%m-%d %H:%M]\")\n#+filetags:%^g\n\n%^{file}")
          ;; :unnarrowed t)
          ;))
  (require 'org-roam-dailies)
  (require 'org-roam-node)
  :config
  (org-roam-setup))

(after! org-roam
    (setq zot_bib (concat org-roam-directory "/master.bib")))
