.doom.d/config.org
** Org-ref
#+begin_src emacs-lisp :tangle yes
(use-package! org-ref
    :after org-roam
    :config
    (setq
         org-ref-completion-library 'org-ref-ivy-cite
         org-ref-get-pdf-filename-function 'org-ref-get-pdf-filename-helm-bibtex
         org-ref-default-bibliography (list zot_bib)
         ;; org-ref-bibliography-notes (concat org-roam-directory "/bibnotes.org")
         ;; org-ref-note-title-format "* TODO %y - %t\n :PROPERTIES:\n  :Custom_ID: %k\n  :NOTER_DOCUMENT: %F\n :ROAM_KEY: cite:%k\n  :AUTHOR: %9a\n  :JOURNAL: %j\n  :YEAR: %y\n  :VOLUME: %v\n  :PAGES: %p\n  :DOI: %D\n  :URL: %U\n :END:\n\n"
         org-ref-notes-directory org-roam-directory
         org-ref-notes-function 'orb-edit-notes
))
#+end_src
** Helm-bibtex
#+begin_src emacs-lisp :tangle yes
(use-package! helm-bibtex
  :after org-roam
  :init
  ; blah blah
  :config
  ;blah blah
  (setq bibtex-format-citation-functions
      '((org-mode . (lambda (x) (insert (concat
                                         "\\cite{"
                                         (mapconcat 'identity x ",")
                                         "}")) ""))))
(setq
      bibtex-completion-pdf-field "file"
      bibtex-completion-bibliography
      (list (concat org-roam-directory "/master.bib"))
      bibtex-completion-library-path (list org-roam-directory)
      ;; not needed as I take notes in org-roam
      ; bibtex-completion-notes-path "articles.org"
))


#+end_src
** Org-roam-bibtex
orb trial config taken from: https://github.com/emacsbliss/emacs-config/blob/master/config.org
Delete if it breaks doom
#+begin_src emacs-lisp :tangle yes
(use-package! org-roam-bibtex
  :after org-roam
  :config
  (require 'org-ref)
  (setq orb-preformat-keywords
   '("citekey" "title" "url" "file" "author-or-editor" "keywords" "date"))
  (setq orb-file-field-extensions '("pdf" "epub" "html" "mp4" "mp3"))
  (add-to-list 'org-roam-capture-templates
        '("b" "Bibliography reference note" entry "*** %?"
          :if-new
          (file+head"research/refs/${citekey}.org"
                    "#+TITLE: ${title}\n#+ROAM_KEY: ${ref}\n#+filetags: Reference notes\n* ${title}\n  :PROPERTIES:\n  :Custom_ID: ${citekey}\n  :URL: ${url}\n  :AUTHOR: ${author-or-editor}\n  :NOTER_DOCUMENT: [[${file}]]\n  :NOTER_PAGE:\n  :KEYWORDS: ${keywords}\n  :END:\n\n")
          :unnarrowed t)))
(after! org-roam (org-roam-bibtex-mode))
#+end_src
** Deft: Note search

Configured only to look in the =org-roam-directory=

#+begin_src emacs-lisp :tangle yes
(setq deft-directory org-roam-directory)
(setq deft-recursive t)
(setq deft-use-filter-string-for-filename t)
(setq deft-default-extension "org")
#+end_src
** PDF export
#+begin_src emacs-lisp :tangle yes
; (setq org-latex-pdf-process (list "latexmk -shell-escape -bibtex -f -pdf %f"))
#+end_src

