.doom.d/config.org
** Org-babel
Notes/Documentation: https://orgmode.org/worg/org-contrib/babel/languages/ob-doc-python.html
#+begin_src emacs-lisp :tangle yes
(org-babel-do-load-languages
 'org-babel-load-languages
 '((python . t)))
#+end_src
** Org-Latex-render
Taken from https://www.reddit.com/r/emacs/comments/9h44lk/i_can_finally_preview_latex_in_orgmode_took_me/
Also consider using https://github.com/yangsheng6810/org-latex-impatient
#+begin_src emacs-lisp :tangle yes
(defun ca/krofna-hack ()
  (when (looking-back (rx "C-c C-x C-l"))
    (save-excursion
      (backward-char 1)
      (org-toggle-latex-fragment))))

(add-hook 'org-mode-hook
          (lambda ()
            (org-cdlatex-mode)
            (add-hook 'post-self-insert-hook #'ca/krofna-hack 'append 'local)))
#+end_src
* TRAMP
Open files in Docker containers like so: /docker:drunk_bardeen:/etc/passwd
#+begin_src emacs-lisp :tangle yes
(push
 (cons
  "docker"
  '((tramp-login-program "docker")
    (tramp-login-args (("exec" "-it") ("%h") ("/bin/bash")))
    (tramp-remote-shell "/bin/sh")
    (tramp-remote-shell-args ("-i") ("-c"))))
 tramp-methods)

(defadvice tramp-completion-handle-file-name-all-completions
  (around dotemacs-completion-docker activate)
  "(tramp-completion-handle-file-name-all-completions \"\" \"/docker:\" returns
    a list of active Docker container names, followed by colons."
  (if (equal (ad-get-arg 1) "/docker:")
      (let* ((dockernames-raw (shell-command-to-string "docker ps | awk '$NF != \"NAMES\" { print $NF \":\" }'"))
             (dockernames (cl-remove-if-not
                           #'(lambda (dockerline) (string-match ":$" dockerline))
                           (split-string dockernames-raw "\n"))))
        (setq ad-return-value dockernames))
    ad-do-it))

#+end_src
* LEDGER
Inspired in part by [[https://plaintextaccounting.org/][plain text accounting]] , but mostly because of [[https://www.youtube.com/watch?v=9zyp8RF-Fyw][this David Mitchell's soapbox]].

#+begin_src emacs-lisp :tangle yes
(use-package ledger-mode
  :mode "\\.ledger\\'")
#+end_src

To update the stock prices every day-ish, I use [[https://github.com/mbhinder/ledger-pricedb][this]] package.
#+begin_src emacs-lisp :tangle yes
(load-file "~/.doom.d/ledger-pricedb/ledger-pricedb.el")
(set 'ledger-pricedb--stocks '("GOOGL" "REVS" "TGT" "JEPI" "AAPL" "SCHD" "VOO" "VNQ" "VYM" "CHPT"))
(set 'ledger-pricedb--pricedb "~/org/finances/ledger.pricedb")

(global-set-key (kbd "C-c s") (lambda () (interactive) (ledger-pricedb-save-pricedb)))
#+end_src
* LIST OF THINGS TO ADD/MODIFY IN THIS CONFIG [8/23]

** DONE Setup magit
Added "+forge" in ~.init.el~
** DONE Setup the `~/org/` directory structure.
** DONE Setup the org-agenda and org-super-agenda
** TODO Calender integration
** DONE Setup org-roam
** DONE Bibliography setup org-ref, helm bibtex, zotero integration
** TODO [#A] Make the habit entry for org-roam-daily
** TODO Setup Ivy, Counsel, deft
** DONE Setup a method to update the dotfiles repository on github
Check out some of the tutorials/guides here: https://dotfiles.github.io/tutorials/. Also, the first time I managed to do this was using a ~bare~ git repository: https://www.atlassian.com/git/tutorials/dotfiles. Have to figure out how to use one of the commands using ~magit~.
*** DONE other dotfiles - .bashrc, .bash_profile, etc.
** TODO Python environment
** TODO Read "How to take notes"
** TODO Make the =org-mode= documents more documents like.
Increase the header fontsize.
** DONE TRAMP setup
https://willschenk.com/articles/2020/tramp_tricks/
https://writequit.org/denver-emacs/presentations/2017-06-20-tramp.html
** TODO [#A] Password manager with Emacs
** TODO Alfred intergration for org-capture
** TODO Terminal mode setup
** DONE [#B] Finance management with ledger
** TODO PDF annotation and org-noter
** TODO RSS reader: elfeed
https://gerlacdt.github.io/posts/emacs-elfeed/
** TODO Go through Uncle Dave's emacs to get some useful functions
** TODO Remove the time and battery display from the touch bar through better touch tools
** TODO [#B] Make a document outlining the most used commands
** TODO Read http://cachestocaches.com/2020/3/my-organized-life/
